import React from "react";

// CSS불러오기
import "../../css/searching.scss";

// 데이터 불러오기 : 캐릭터 리스트 데이터
// import { catListData } from "../data/swiper_cat";


// 캐릭터 리스트 결과 컴포넌트
// import SearchingCat from "./SearchingCat";

function Searching({kword}) {
    // kword - 전달받은 키워드
    console.log("kword:", kword);
 
  // 코드 리턴구역 ////////////////////////
  return (
    <>
      {/* 전체 검색모듈 코드 */}
      <section className="schbx">
      냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠냠냠냠냠냔ㅁ냠냠냠
      </section>
    </>
  );
}

export default Searching;
